//以下是页面公式配置文件，公式解析参见公共文件： SYSA\inc\FormulaRulesExecer.js
window.CurrFormulaConfig = {
	FieldsMap:  {   //公式字段映射关系
		"num%d": "数量",
		"pricetest%d": "未税单价",  //price1 / InitPrice/单价
		"taxRate_%d": "税率",
		"zhekou%d": "折扣",
		"priceAfterDiscount_%d": "未税折后单价",   //DstPrice / 未税折后单价
		"priceAfterTax_%d": "含税单价",			//	TaxPrice  /含税单价
		"PriceAfterDiscountTaxPre_%d": "含税折后单价",  //含税折后单价 /TaxDstPrice 
		"TaxDstMoney_%d": "税后总价",     //采购总价：【折后】【惠前】【未税】
		"Concessions_%d": "明细优惠",
		"Concessions_%d[max]": "优惠最大值",
		"Concessions_%d[msg]": "优惠提示语",
		"priceAfterDiscountTax_%d": "优惠后单价",
		"MoneyAfterDiscount_%d": "金额",
		"taxValue_%d": "税额",
		"moneyall%d": "优惠后总价",       //money1 
		"taxRate_%d[IncludeTax]": "产品是否含税"
	},
	FormulaGroups: [
		{
				filtercode: "产品是否含税==0",
				tigger: "@@init",
				Formulas: [
				"含税单价=含税折后单价/折扣",
				"未税单价=含税折后单价/折扣/(1+税率*0.01)",
				"未税折后单价=含税折后单价/(1+税率*0.01)",
				"税后总价=含税折后单价*数量",
				"明细优惠=@@手动录入",
				"优惠后总价=(含税折后单价*数量)-明细优惠",
				"金额=(含税折后单价*数量-明细优惠)/(1+税率*0.01)",
				"税额=(含税折后单价*数量-明细优惠)-(含税折后单价*数量-明细优惠)/(1+税率*0.01)",
				"优惠后单价=(含税折后单价*数量-明细优惠)/数量",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "产品是否含税==1",
			tigger: "@@init",
			Formulas: [
				"含税单价=含税折后单价/折扣",
				"未税单价=含税折后单价/折扣/(1+税率*0.01)",
				"未税折后单价=含税折后单价/(1+税率*0.01)",
				"税后总价=含税折后单价*数量",
				"明细优惠=@@手动录入",
				"优惠后总价=(含税折后单价*数量)-明细优惠",
				"金额=(含税折后单价*数量-明细优惠)/(1+税率*0.01)",
				"税额=(含税折后单价*数量-明细优惠)-(含税折后单价*数量-明细优惠)/(1+税率*0.01)",
				"优惠后单价=(含税折后单价*数量-明细优惠)/数量",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "含税单价",
			Formulas: [
				"含税折后单价=含税单价*折扣",
				"未税单价=含税单价/(1+税率*0.01)",
				"未税折后单价=含税单价/(1+税率*0.01)*折扣",
				"税后总价=含税单价*折扣*数量",
				"明细优惠=@@手动录入",
				"优惠后总价=(含税单价*折扣*数量)-明细优惠",
				"金额=(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"税额=(含税单价*折扣*数量-明细优惠)-(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"优惠后单价=(含税单价*折扣*数量-明细优惠)/数量",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "未税单价",
			Formulas: [
				"未税折后单价=未税单价*折扣",
				"含税单价=未税单价*(1+税率*0.01)",
				"含税折后单价=含税单价*折扣",
				"税后总价=含税单价*折扣*数量",
				"明细优惠=@@手动录入",
				"优惠后总价=(含税单价*折扣*数量)-明细优惠",
				"金额=(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"税额=(含税单价*折扣*数量-明细优惠)-(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"优惠后单价=(含税单价*折扣*数量-明细优惠)/数量",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "数量",
			Formulas: [
				"税后总价=含税单价*折扣*数量",
				"明细优惠=@@手动录入",
				"优惠后总价=(含税单价*折扣*数量)-明细优惠",
				"金额=((含税单价*折扣*数量)-明细优惠)/(1+税率*0.01)",
				"税额=(含税单价*折扣*数量-明细优惠)-(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"优惠后单价=(含税单价*折扣*数量-明细优惠)/数量",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "税率",
			Formulas: [
				"税后总价=@@不变",
				"含税折后单价=@@不变",
				"明细优惠=@@手动录入",
				"优惠后总价=@@不变",
				"优惠后单价=@@不变",
				"金额=(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"税额=(含税单价*折扣*数量-明细优惠)-(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"未税单价=含税单价/(1+税率*0.01)",
				"未税折后单价=含税单价/(1+税率*0.01)*折扣",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "折扣",
			Formulas: [
				"未税折后单价=含税单价/(1+税率*0.01)*折扣",
				"含税折后单价=含税单价*折扣",
				"税后总价=含税单价*折扣*数量",
				"明细优惠=@@手动录入",
				"优惠后总价=(含税单价*折扣*数量)-明细优惠",
				"金额=(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"税额=(含税单价*折扣*数量-明细优惠)-(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"优惠后单价=(含税单价*折扣*数量-明细优惠)/数量",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "税后总价",
			Formulas: [
				"明细优惠=@@手动录入",
				"优惠后总价=税后总价-明细优惠",
				"优惠后单价=(税后总价-明细优惠)/数量",
				"金额=(税后总价-明细优惠)/(1+税率*0.01)",
				"税额=(税后总价-明细优惠)-(税后总价-明细优惠)/(1+税率*0.01)",
				"含税折后单价=税后总价/数量",
				"含税单价=税后总价/数量/折扣",
				"未税单价=税后总价/数量/折扣/(1+税率*0.01)",
				"未税折后单价=税后总价/数量/(1+税率*0.01)",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "金额",
			Formulas: [
				"优惠后总价=金额*(1+税率*0.01)",
				"优惠后单价=优惠后总价/数量",
				"税额=优惠后总价-金额",
				"明细优惠=@@手动录入",
				"税后总价=优惠后总价*1+明细优惠*1",
				"含税折后单价=(优惠后总价*1+明细优惠*1)/数量",
				"含税单价=(优惠后总价*1+明细优惠*1)/数量/折扣",
				"未税单价=(优惠后总价*1+明细优惠*1)/数量/折扣/(1+税率*0.01)",
				"未税折后单价=(优惠后总价*1+明细优惠*1)/数量/(1+税率*0.01)",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "明细优惠",
			Formulas: [
				"税后总价=@@不变",
				"优惠后总价=(含税单价*折扣*数量)-明细优惠",
				"优惠后单价=(含税单价*折扣*数量-明细优惠)/数量",
				"金额=(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"税额=(含税单价*折扣*数量-明细优惠)-(含税单价*折扣*数量-明细优惠)/(1+税率*0.01)",
				"含税折后单价=@@不变",
				"含税单价=@@不变",
				"未税折后单价=@@不变",
				"未税单价=@@不变",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		},
		{
			filtercode: "",
			tigger: "优惠后总价",
			Formulas: [
				"优惠后单价=优惠后总价/数量",
				"明细优惠=@@手动录入",
				"税后总价=优惠后总价*1+明细优惠*1",
				"含税折后单价=(优惠后总价*1+明细优惠*1)/数量",
				"含税单价=(优惠后总价*1+明细优惠*1)/数量/折扣",
				"金额=优惠后总价/(1+税率*0.01)",
				"税额=优惠后总价-优惠后总价/(1+税率*0.01)",
				"未税折后单价=(优惠后总价*1+明细优惠*1)/数量/(1+税率*0.01)",
				"未税单价=(优惠后总价*1+明细优惠*1)/数量/(1+税率*0.01)/折扣",
				"优惠最大值=税后总价",
				"优惠提示语='不能大于'+税后总价"
			]
		}
	]
}